export const AUTH_MESSAGES = {
    FIRST_NAME: {
        IS_STRING: 'نام باید از نوع متن باشد',
        IS_NOT_EMPTY: 'نام نمی‌تواند خالی باشد',
        MIN_LENGTH: 'نام باید حداقل ۲ کاراکتر داشته باشد',
        MAX_LENGTH: 'نام نمی‌تواند بیشتر از ۱۰۰ کاراکتر باشد',
    },

    LAST_NAME: {
        IS_STRING: 'نام خانوادگی باید از نوع متن باشد',
        IS_NOT_EMPTY: 'نام خانوادگی نمی‌تواند خالی باشد',
        MIN_LENGTH: 'نام خانوادگی باید حداقل ۲ کاراکتر داشته باشد',
        MAX_LENGTH: 'نام خانوادگی نمی‌تواند بیشتر از ۱۰۰ کاراکتر باشد',
    },

    EMAIL: {
        IS_EMAIL: 'فرمت ایمیل وارد شده نامعتبر است',
        IS_NOT_EMPTY: 'ایمیل نمی‌تواند خالی باشد',
        MAX_LENGTH: (max: number) => `ایمیل نمی‌تواند بیشتر از ${max} کاراکتر باشد`,
    },

    PHONE_NUMBER: {
        IS_STRING: 'شماره تلفن باید از نوع متن باشد',
        IS_NOT_EMPTY: 'شماره تلفن نمی‌تواند خالی باشد',
        MATCHES: 'فرمت شماره تلفن نامعتبر است',
        MIN_LENGTH: 'شماره تلفن باید حداقل ۱۰ کاراکتر داشته باشد', // NEW
        MAX_LENGTH: 'شماره تلفن نمی‌تواند بیشتر از ۱۵ کاراکتر باشد', // NEW
        MATCHES_E164: 'فرمت شماره تلفن نامعتبر است (مثال: +989121234567)', // NEW
    },
    IDENTIFIER: {
        IS_STRING: 'ایمیل یا شماره تلفن باید از نوع متن باشد',
        IS_NOT_EMPTY: 'ایمیل یا شماره تلفن نمی‌تواند خالی باشد',
        MAX_LENGTH: (max: number) =>
            `ایمیل یا شماره تلفن نمی‌تواند بیشتر از ${max} کاراکتر باشد`,
    },
    OTP: {
        IS_STRING: 'کد تایید باید از نوع متن باشد',
        IS_NOT_EMPTY: 'کد تایید نمی‌تواند خالی باشد',
        LENGTH: 'کد تایید باید دقیقاً ۶ رقم باشد',
    },
}